---
kind: other
id: Properties.T:Autodesk.Revit.Exceptions.RegenerationFailedException
source: html/479f4076-0834-9367-5033-2f6ca2d91ea2.htm
---
# RegenerationFailedException Properties

The information of the function throwing the exception.